КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПолномочийМЧД/КонтурЛогистика_НастройкиПолномочийМЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПолномочийМЧД</name>
  <resources>
    <name>НаименованиеПолномочия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Полномочие</name>
    <type>
      <types>EnumRef.КонтурЛогистика_Полномочия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТитула</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <comment>При проверке полномочий задается через подключаемы модуль</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПолномочийМЧД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПроверитьПолномочияМЧД(Титул, МЧД, Полномочие, ТипТитула, ОтпечатокСертификата) Экспорт
	
	Если Не МЧД.ПроверятьПолномочия Тогда 
		Возврат Истина;
	КонецЕсли;

	// Проверим доверие
	Если КонтурЛогистика_МашиночитаемыеДовернностиСервер.ПроверитьДоверие(МЧД, ОтпечатокСертификата, , Истина, Полномочие) Тогда
		Возврат Истина;
	КонецЕсли;
	
	// Проверим разрешенные полномочия
	ПолномочияИзНастроек = СписокПолномочийИзНастроек(Титул, Полномочие, ТипТитула);
	ПолномочияИзМЧД = МЧД.Полномочия.Выгрузить();
	
	Если ПолномочияИзНастроек.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для каждого ПолномочиеМЧД Из ПолномочияИзМЧД Цикл
		
		Если ПолномочияИзНастроек.Найти(ПолномочиеМЧД.Код, "КодКлассификатора") <> Неопределено Тогда
			Возврат Истина;	
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
Конецфункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СписокПолномочийИзНастроек(Титул, Полномочие, ТипТитула)
	
	СписокПолномочий = Новый ТаблицаЗначений;
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("Документ", Титул);
	ДопПараметр = КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПолучитьЗначениеДополнительногоПараметраДляПроверкиПолномочийМЧД", , ПараметрыПМ);
	
	Если ЗначениеЗаполнено(ДопПараметр) Тогда
		
		СписокПолномочий = ПолучитьПолномочияИзНастроек(Полномочие, ТипТитула, ДопПараметр);
		
		Если СписокПолномочий.Количество() = 0 Тогда 		
			СписокПолномочий = ПолучитьПолномочияИзНастроек(Полномочие, , ДопПараметр);			
		КонецЕсли;
					
	КонецЕсли;
	
	Если СписокПолномочий.Количество() = 0 Тогда 		
		СписокПолномочий = ПолучитьПолномочияИзНастроек(Полномочие, ТипТитула);			
	КонецЕсли;
	Если СписокПолномочий.Количество() = 0 Тогда 		
		СписокПолномочий = ПолучитьПолномочияИзНастроек(Полномочие);			
	КонецЕсли;
	
	Возврат СписокПолномочий;
		
Конецфункции

Функция ПолучитьПолномочияИзНастроек(Полномочие, ТипТитула = Неопределено, ДопПараметр = Неопределено)
	
	Если Не ЗначениеЗаполнено(ТипТитула) Тогда
		ТипЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПустаяСсылка();
	Иначе
		ТипЛогистика = ТипТитула;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтурЛогистика_НастройкиПолномочийМЧД.КодКлассификатора КАК КодКлассификатора
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_НастройкиПолномочийМЧД КАК КонтурЛогистика_НастройкиПолномочийМЧД
		|ГДЕ
		|	КонтурЛогистика_НастройкиПолномочийМЧД.Полномочие = &Полномочие
		|	И КонтурЛогистика_НастройкиПолномочийМЧД.ТипТитула = &ТипТитула
		|	И КонтурЛогистика_НастройкиПолномочийМЧД.ДопПараметр = &ДопПараметр";
	
	Запрос.УстановитьПараметр("Полномочие",  Полномочие);
	Запрос.УстановитьПараметр("ТипТитула",   ТипЛогистика);
	Запрос.УстановитьПараметр("ДопПараметр", ДопПараметр);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Возврат РезультатЗапроса;
	
КонецФункции

#КонецОбласти

#КонецЕсли
